In [1]:
import pandas as pd

# pd is the alias name
import numpy as np

### Pandas
We have 2 types of data in Pandas

<b> 1) Series</b>
a) It is equivalent to a single column of data<br>
b) Series will bear index. There can be multiple indexes for a series<br> 
c) By default the index generated will start from 0 towards positive.<br>

<b> 2) DataFrame</b><br>
a) Data Represented into Rows and Columns is called DataFrame.(Tabular Structure)<br>
b) DataFrame will bear index. There can be multiple indexes for a DataFrame.<br>
c) By default the index generated will start from 0 towards positive.<br>

Note<br>
<b>A dataframe can be made up of a single column but a series cannot bear multiple columns</b>

### Create a DataFrame

#### 1) Using Dictionary

In [2]:
d = {'Name':['Varun','Kartik','Shweta','Divya','Aman','Keshav'],
     'Age':[23,24,25,31,29,33],
     'Salary':[31500,28000,37500,43000,49000,54000]
    }
print(d)

{'Name': ['Varun', 'Kartik', 'Shweta', 'Divya', 'Aman', 'Keshav'], 'Age': [23, 24, 25, 31, 29, 33], 'Salary': [31500, 28000, 37500, 43000, 49000, 54000]}

In [3]:
df = pd.DataFrame(d)
df

     Name  Age  Salary
0   Varun   23   31500
1  Kartik   24   28000
2  Shweta   25   37500
3   Divya   31   43000
4    Aman   29   49000
5  Keshav   33   54000

In [4]:
df.shape

(6, 3)

In [5]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

#### DataFrame Functions
<b>1) head(n) - </b><br>
Return top n rows of the dataframe. If n is not mentioned, it returns top 5 rows 

<b>2) tail(n) -  </b><br>
Return bottom n rows of the dataframe. If n is not mentioned, it returns bottom 5 rows

<b>3) sample(n) - </b><br>
Return random n rows of the dataframe. If n is not mentioned it returns random 1 row

In [6]:
df

     Name  Age  Salary
0   Varun   23   31500
1  Kartik   24   28000
2  Shweta   25   37500
3   Divya   31   43000
4    Aman   29   49000
5  Keshav   33   54000

In [7]:
df.head(4)

     Name  Age  Salary
0   Varun   23   31500
1  Kartik   24   28000
2  Shweta   25   37500
3   Divya   31   43000

In [8]:
df.tail(3)

     Name  Age  Salary
3   Divya   31   43000
4    Aman   29   49000
5  Keshav   33   54000

In [9]:
df.sample()

     Name  Age  Salary
1  Kartik   24   28000

In [10]:
df.sample(3)

     Name  Age  Salary
3   Divya   31   43000
5  Keshav   33   54000
4    Aman   29   49000

#### How to Fetch column values from DataFarme

In [11]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

#### Fetching single column

In [12]:
d1 = df['Salary']
print(d1)
print(type(d1))

0    31500
1    28000
2    37500
3    43000
4    49000
5    54000
Name: Salary, dtype: int64
<class 'pandas.core.series.Series'>

#### Fetching multiple columns

In [13]:
# select Salary,Age,name from df
d2 = df[['Salary','Age','Name','Age']]
d2

   Salary  Age    Name  Age
0   31500   23   Varun   23
1   28000   24  Kartik   24
2   37500   25  Shweta   25
3   43000   31   Divya   31
4   49000   29    Aman   29
5   54000   33  Keshav   33

In [14]:
print(type(d2))

<class 'pandas.core.frame.DataFrame'>

In [15]:
d3 = df[['Age']]
d3

   Age
0   23
1   24
2   25
3   31
4   29
5   33

In [16]:
print(type(d3))

<class 'pandas.core.frame.DataFrame'>

In [17]:
df.head()

     Name  Age  Salary
0   Varun   23   31500
1  Kartik   24   28000
2  Shweta   25   37500
3   Divya   31   43000
4    Aman   29   49000

In [18]:
df.dtypes

Name      object
Age        int64
Salary     int64
dtype: object

#### How to add aNe column to the DataFrame

In [19]:
print(df.columns)
print(df.shape)

Index(['Name', 'Age', 'Salary'], dtype='object')
(6, 3)

In [20]:
df['Dept'] = ['IT','Sales','Logistics','IT','Marketing','HR']

In [21]:
df.head(6)

     Name  Age  Salary       Dept
0   Varun   23   31500         IT
1  Kartik   24   28000      Sales
2  Shweta   25   37500  Logistics
3   Divya   31   43000         IT
4    Aman   29   49000  Marketing
5  Keshav   33   54000         HR

#### Q) Find all the records where Salary >32000

In [22]:
r1 = df[df['Salary']>32000]
r1

     Name  Age  Salary       Dept
2  Shweta   25   37500  Logistics
3   Divya   31   43000         IT
4    Aman   29   49000  Marketing
5  Keshav   33   54000         HR

#### Q) Fetch Name, Salary and Dept where Salary <40000

In [23]:
r2 = df[['Name','Salary','Dept']][df['Salary']<40000]
r2

     Name  Salary       Dept
0   Varun   31500         IT
1  Kartik   28000      Sales
2  Shweta   37500  Logistics

In [24]:
r3 = df[['Name','Salary','Dept']].query('Salary<40000')
r3

     Name  Salary       Dept
0   Varun   31500         IT
1  Kartik   28000      Sales
2  Shweta   37500  Logistics

#### Aggregate Functions - sum(),min(),max(),count(),mean(),median()

In [25]:
print('Max Salary',df['Salary'].max())
print('Min Salary',df['Salary'].min())
print('Sum Salary',df['Salary'].sum())
print('Mean Salary',df['Salary'].mean())
print('Median Salary',df['Salary'].median())
print('Count Salary',df['Salary'].count())

Max Salary 54000
Min Salary 28000
Sum Salary 243000
Mean Salary 40500.0
Median Salary 40250.0
Count Salary 6

#### Q) Find the employee details who earned max salary

In [26]:
# df[54000]

In [27]:
r6 = df[df['Salary'] == df['Salary'].max()]
r6

     Name  Age  Salary Dept
5  Keshav   33   54000   HR

#### Q) Find the emp details whose Salary>35000 and Age<30

In [28]:
# r7 = df[(df['Salary']>35000) & (df['Age']<30)]
# r7
r8 = df.query('Salary>35000 and Age<30')
r8

     Name  Age  Salary       Dept
2  Shweta   25   37500  Logistics
4    Aman   29   49000  Marketing

In [29]:
r7 = df[df['Salary']>35000][df['Age']<30]
r7

<ipython-input-29-5df9b15983e6>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  r7 = df[df['Salary']>35000][df['Age']<30]

     Name  Age  Salary       Dept
2  Shweta   25   37500  Logistics
4    Aman   29   49000  Marketing

#### Q) Find all the emp details where Age<30 or dept is not IT

In [30]:
r9 = df[(df['Age']<30) | (df['Dept']!='IT')]
r9

     Name  Age  Salary       Dept
0   Varun   23   31500         IT
1  Kartik   24   28000      Sales
2  Shweta   25   37500  Logistics
4    Aman   29   49000  Marketing
5  Keshav   33   54000         HR

In [31]:
r10 = df.query("Age<30 or Dept!='IT'")
r10

     Name  Age  Salary       Dept
0   Varun   23   31500         IT
1  Kartik   24   28000      Sales
2  Shweta   25   37500  Logistics
4    Aman   29   49000  Marketing
5  Keshav   33   54000         HR

In [32]:
r11 = df.query("(Age<30 or Dept=='IT') or Name=='Varun'")
r11

     Name  Age  Salary       Dept
0   Varun   23   31500         IT
1  Kartik   24   28000      Sales
2  Shweta   25   37500  Logistics
3   Divya   31   43000         IT
4    Aman   29   49000  Marketing

#### How to read data from .csv, .xlsx files?

pd.read_csv('a.csv')<br>
pd.read_xlsx('b.xlsx')

In [33]:
df2 = pd.read_csv('E:\Institute Curriculum\Imarticus_Data\SQL\Session1_dataset\dept.csv')
df2.head()

   D_ID  DName     centre     contact  assets  commission
0     1  SALES     Mumbai  111-737354      21        0.42
1     2  MARKT     Indore  111-324233      20        0.45
2     3    INV     Mumbai  111-334542      15        0.32
3     4     HR      Delhi  111-243432      24        0.56
4     5     IT  Bangalore  111-525346      13        0.18

In [62]:
df1 = pd.read_csv('SalesRetails.csv')
df1.head()

  Region    Sales    Profit
0    USA      13.08    4.56
1     UK     252.16   90.72
2     UK     193.28   54.08
3     UK      35.44    4.96
4     UK      71.60   11.44

In [63]:
df1.shape

(350, 3)

In [64]:
df1.columns

Index(['Region', '  Sales  ', 'Profit'], dtype='object')

In [65]:
df1['Sales']

KeyError: 'Sales'

#### Rename all the columns

In [66]:
df1.columns =['Region','Sales','Profit']
df1.columns

Index(['Region', 'Sales', 'Profit'], dtype='object')

In [67]:
df.shape

(6, 4)

In [68]:
df.columns

Index(['Name', 'Age', 'Salary', 'Dept'], dtype='object')

In [69]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Region  350 non-null    object
 1   Sales   350 non-null    float64
 2   Profit  350 non-null    float64
dtypes: float64(2), object(1)
memory usage: 8.3+ KB

In [70]:
df1.head()

  Region   Sales  Profit
0    USA   13.08    4.56
1     UK  252.16   90.72
2     UK  193.28   54.08
3     UK   35.44    4.96
4     UK   71.60   11.44

In [71]:
d1 = df1['Region'].value_counts()
d1

USA      187
UK       103
India     60
Name: Region, dtype: int64

In [72]:
print(type(d1))

<class 'pandas.core.series.Series'>

In [73]:
df1['Region'].unique()

array(['USA', 'UK', 'India'], dtype=object)

In [74]:
df1['Region'].nunique()

3

### Creating DataFrame using List of List

In [79]:
data = [['Rajeev',33,89],
        ['Sandeep',34,99],
        ['Mohit',22,70]]
print(data)

[['Rajeev', 33, 89], ['Sandeep', 34, 99], ['Mohit', 22, 70]]

In [94]:
df2 = pd.DataFrame(data,columns=['Name','Age','Marks'],
                  index =['R1','R2','R3'])
df2

       Name  Age  Marks
R1   Rajeev   33     89
R2  Sandeep   34     99
R3    Mohit   22     70

In [95]:
print(df2.index)
print(df2.values)
print(df2.columns)

Index(['R1', 'R2', 'R3'], dtype='object')
[['Rajeev' 33 89]
 ['Sandeep' 34 99]
 ['Mohit' 22 70]]
Index(['Name', 'Age', 'Marks'], dtype='object')

In [96]:
df3 = pd.DataFrame(df2.values)
df3.head()

         0   1   2
0   Rajeev  33  89
1  Sandeep  34  99
2    Mohit  22  70

In [97]:
df3.columns=['X','A','Z']
df3.index=['Q','A','R']
df3

         X   A   Z
Q   Rajeev  33  89
A  Sandeep  34  99
R    Mohit  22  70

In [100]:
# df3.sort_index()                # axis=0
df3.sort_index(ascending=False)
# df3.sort_index() # default axis is 0 (row wise)

         X   A   Z
R    Mohit  22  70
Q   Rajeev  33  89
A  Sandeep  34  99

In [103]:
df3.sort_index(axis=1)  # by default it sorts columns in ascending order
# OR to print column names in reverse alphabetical order 
# df3.sort_index(axis=1,ascending=False)

    A        X   Z
Q  33   Rajeev  89
A  34  Sandeep  99
R  22    Mohit  70

In [105]:
df3.sort_index(axis=1,ascending=False)

    Z        X   A
Q  89   Rajeev  33
A  99  Sandeep  34
R  70    Mohit  22

In [107]:
df3.sort_values(by='Z', ascending=True)
# OR
# df3.sort_values(by='Z', ascending=False)

         X   A   Z
R    Mohit  22  70
Q   Rajeev  33  89
A  Sandeep  34  99

In [110]:
df3.sort_values(by='A', ascending=False)

         X   A   Z
A  Sandeep  34  99
Q   Rajeev  33  89
R    Mohit  22  70

In [114]:
df3.sort_values(by='X',ascending=False)

         X   A   Z
A  Sandeep  34  99
Q   Rajeev  33  89
R    Mohit  22  70

In [116]:
df3['A'].sort_values()

R    22
Q    33
A    34
Name: A, dtype: object

In [115]:
df3.sort_values(by=['A','Z'], ascending=True)
# First sorted by A, then sorted by Z

         X   A   Z
R    Mohit  22  70
Q   Rajeev  33  89
A  Sandeep  34  99

In [118]:
df1.head(3)

  Region   Sales  Profit
0    USA   13.08    4.56
1     UK  252.16   90.72
2     UK  193.28   54.08

In [119]:
res = df1.sort_values(by=['Region','Sales'], 
                ascending=[True, False])
res.head()

    Region    Sales  Profit
219  India  1696.64 -148.46
179  India  1111.56  200.04
213  India   738.29 -166.15
67   India   635.63  266.13
275  India   551.56 -101.12

In [120]:
res.iloc[50:70]

    Region    Sales  Profit
115  India    27.76    1.36
55   India    21.84    3.00
151  India    19.30    7.10
66   India    17.96    5.72
145  India    17.86   -2.70
198  India    16.42   -1.28
182  India    14.40    3.28
132  India    14.14   -1.26
200  India     9.38    2.78
133  India     5.55   -0.77
279     UK  3408.00  238.56
292     UK  1970.50   49.22
188     UK  1480.37  333.05
344     UK  1454.83  -54.59
117     UK  1052.16    0.00
189     UK   982.91  -12.29
70      UK   928.26  -81.22
61      UK   875.22  139.98
68      UK   874.68  411.06
267     UK   607.36  133.60

In [123]:
d = {
    'Name':['Alisa','John','Cathrine','Alisa','John','Cathrine',
            'Alisa','John','Cathrine','Alisa','John','Cathrine'],
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
            'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
     
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
   'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}
 
df4 = pd.DataFrame(d)
df4

        Name        Exam      Subject  Score
0      Alisa  Semester 1  Mathematics     62
1       John  Semester 1  Mathematics     47
2   Cathrine  Semester 1  Mathematics     55
3      Alisa  Semester 1      Science     74
4       John  Semester 1      Science     31
5   Cathrine  Semester 1      Science     77
6      Alisa  Semester 2  Mathematics     85
7       John  Semester 2  Mathematics     63
8   Cathrine  Semester 2  Mathematics     42
9      Alisa  Semester 2      Science     67
10      John  Semester 2      Science     89
11  Cathrine  Semester 2      Science     81

### df.iloc and loc
They are used for indexing, slicing and filtering

#### df.iloc
1) iloc is used for indexing or selecting based on position .i.e. by row number and column number. It accpets only integer. it is 0 based


#### df.loc
1) loc is used for indexing or selecting based on name .i.e. by row name and column name (explicit index)<br>
2) It can be used for filtering as well.

In [124]:
df4.head()

       Name        Exam      Subject  Score
0     Alisa  Semester 1  Mathematics     62
1      John  Semester 1  Mathematics     47
2  Cathrine  Semester 1  Mathematics     55
3     Alisa  Semester 1      Science     74
4      John  Semester 1      Science     31

In [125]:
df4.iloc[:4,:]

       Name        Exam      Subject  Score
0     Alisa  Semester 1  Mathematics     62
1      John  Semester 1  Mathematics     47
2  Cathrine  Semester 1  Mathematics     55
3     Alisa  Semester 1      Science     74

In [127]:
df4.iloc[2:6,1:3]

         Exam      Subject
2  Semester 1  Mathematics
3  Semester 1      Science
4  Semester 1      Science
5  Semester 1      Science

In [129]:
df4.iloc[:5,:-2]

       Name        Exam
0     Alisa  Semester 1
1      John  Semester 1
2  Cathrine  Semester 1
3     Alisa  Semester 1
4      John  Semester 1

In [131]:
df4.iloc[-6:,::3]

        Name  Score
6      Alisa     85
7       John     63
8   Cathrine     42
9      Alisa     67
10      John     89
11  Cathrine     81

In [133]:
df4.loc[:5,['Name','Exam']]

       Name        Exam
0     Alisa  Semester 1
1      John  Semester 1
2  Cathrine  Semester 1
3     Alisa  Semester 1
4      John  Semester 1
5  Cathrine  Semester 1

In [135]:
df4.loc[2:7,'Name':'Subject']

       Name        Exam      Subject
2  Cathrine  Semester 1  Mathematics
3     Alisa  Semester 1      Science
4      John  Semester 1      Science
5  Cathrine  Semester 1      Science
6     Alisa  Semester 2  Mathematics
7      John  Semester 2  Mathematics

In [139]:
df4.loc[2:7,1:3]

TypeError: cannot do slice indexing on Index with these indexers [1] of type int

In [142]:
df4.loc[3:5,['Name','Score','Exam']]

       Name  Score        Exam
3     Alisa     74  Semester 1
4      John     31  Semester 1
5  Cathrine     77  Semester 1

In [145]:
df4.head()

       Name        Exam      Subject  Score
0     Alisa  Semester 1  Mathematics     62
1      John  Semester 1  Mathematics     47
2  Cathrine  Semester 1  Mathematics     55
3     Alisa  Semester 1      Science     74
4      John  Semester 1      Science     31

In [144]:
df4.iloc[2,3]

55

In [146]:
df4.iloc[:1,0]

0    Alisa
Name: Name, dtype: object

In [147]:
print(type(df4.iloc[:1,0]))

<class 'pandas.core.series.Series'>

In [148]:
df4.iloc[:1,[0]]

    Name
0  Alisa

In [149]:
print(type(df4.iloc[:1,[0]]))

<class 'pandas.core.frame.DataFrame'>

In [153]:
df4.iloc[:4,[0,2,3]]

       Name      Subject  Score
0     Alisa  Mathematics     62
1      John  Mathematics     47
2  Cathrine  Mathematics     55
3     Alisa      Science     74

In [156]:
df4.loc[4:7,'Subject':]

       Subject  Score
4      Science     31
5      Science     77
6  Mathematics     85
7  Mathematics     63

In [157]:
df3.head()

         X   A   Z
Q   Rajeev  33  89
A  Sandeep  34  99
R    Mohit  22  70

In [158]:
df3.loc[['Q','R'],'A':]

    A   Z
Q  33  89
R  22  70

In [160]:
df3.loc[:2,'A':]

TypeError: cannot do slice indexing on Index with these indexers [2] of type int

In [159]:
df3.iloc[:2,::2]

         X   Z
Q   Rajeev  89
A  Sandeep  99

#### Filtering Using loc

In [161]:
df4.head()

       Name        Exam      Subject  Score
0     Alisa  Semester 1  Mathematics     62
1      John  Semester 1  Mathematics     47
2  Cathrine  Semester 1  Mathematics     55
3     Alisa  Semester 1      Science     74
4      John  Semester 1      Science     31

In [162]:
df4.loc[df4['Score']>70]

        Name        Exam      Subject  Score
3      Alisa  Semester 1      Science     74
5   Cathrine  Semester 1      Science     77
6      Alisa  Semester 2  Mathematics     85
10      John  Semester 2      Science     89
11  Cathrine  Semester 2      Science     81

In [163]:
df4.iloc[df['Score']>70]

KeyError: 'Score'

### Groupby

In [164]:
df4.head()

       Name        Exam      Subject  Score
0     Alisa  Semester 1  Mathematics     62
1      John  Semester 1  Mathematics     47
2  Cathrine  Semester 1  Mathematics     55
3     Alisa  Semester 1      Science     74
4      John  Semester 1      Science     31

### Q) Find sum of score based on Subject

In [175]:
r1 = df4.groupby(['Subject'])['Score'].sum()
r1

Subject
Mathematics    354
Science        419
Name: Score, dtype: int64

In [169]:
print(type(r1))

<class 'pandas.core.series.Series'>

### Q) Find mean of Score based on Subject and Exam

In [172]:
r2 = df4.groupby(['Subject','Exam'])['Score'].mean()
r2

Subject      Exam
Mathematics  Semester 1    54.666667
             Semester 2    63.333333
Science      Semester 1    60.666667
             Semester 2    79.000000
Name: Score, dtype: float64

In [173]:
print(type(r2))

<class 'pandas.core.series.Series'>

In [174]:
print(r2.index)

MultiIndex([('Mathematics', 'Semester 1'),
            ('Mathematics', 'Semester 2'),
            (    'Science', 'Semester 1'),
            (    'Science', 'Semester 2')],
           names=['Subject', 'Exam'])

In [176]:
r2 = df4['Score'].groupby([df4['Subject'],df4['Exam']]).mean()
r2

Subject      Exam
Mathematics  Semester 1    54.666667
             Semester 2    63.333333
Science      Semester 1    60.666667
             Semester 2    79.000000
Name: Score, dtype: float64

In [177]:
print(r2.values)

[54.66666667 63.33333333 60.66666667 79.        ]

In [181]:
df1.head()

  Region   Sales  Profit
0    USA   13.08    4.56
1     UK  252.16   90.72
2     UK  193.28   54.08
3     UK   35.44    4.96
4     UK   71.60   11.44

### isin()

In [183]:
reg = ['USA','India']
r5 = df1[df1['Region'].isin(reg)]
r5.head()

   Region   Sales  Profit
0     USA   13.08    4.56
11    USA   20.76    9.54
12    USA  210.64   50.48
13    USA   80.10   37.62
16    USA   18.84   -6.60

In [184]:
r5['Region'].value_counts()

USA      187
India     60
Name: Region, dtype: int64

In [185]:
reg = ['USA','India']
r6 = df1[~df1['Region'].isin(reg)] # Region is not in 'USA' and 'India'
r6.head()

  Region   Sales  Profit
1     UK  252.16   90.72
2     UK  193.28   54.08
3     UK   35.44    4.96
4     UK   71.60   11.44
5     UK   56.12   21.32

In [186]:
r6['Region'].value_counts()

UK    103
Name: Region, dtype: int64

### between()

In [187]:
r7 = df1[df1['Sales'].between(100,150)]
r7.head()

   Region   Sales  Profit
14     UK  132.64   35.76
27    USA  141.29  -73.05
29    USA  114.82  -49.82
35    USA  138.18   53.76
46  India  125.44   -0.06